SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Inkplate_core-2.0.0/boards.txt
menu.UploadSpeed=Upload Speed
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On

Inkplate6.name=Inkplate 6 (ESP32)

Inkplate6.upload.tool=esptool_py
Inkplate6.upload.maximum_size=1310720
Inkplate6.upload.maximum_data_size=327680
Inkplate6.upload.flags=
Inkplate6.upload.extra_flags=

Inkplate6.serial.disableDTR=true
Inkplate6.serial.disableRTS=true

Inkplate6.build.tarch=xtensa
Inkplate6.build.bootloader_addr=0x1000
Inkplate6.build.target=esp32
Inkplate6.build.mcu=esp32
Inkplate6.build.core=esp32
Inkplate6.build.variant=esp32
Inkplate6.build.board=ESP32_DEV

Inkplate6.build.f_cpu=240000000L
Inkplate6.build.flash_size=4MB
Inkplate6.build.flash_freq=40m
Inkplate6.build.flash_mode=dio
Inkplate6.build.boot=dio
Inkplate6.build.partitions=default
Inkplate6.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
Inkplate6.build.extra_libs=

Inkplate6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate6.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate6.menu.PartitionScheme.default.build.partitions=default
Inkplate6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Inkplate6.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
Inkplate6.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Inkplate6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate6.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate6.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Inkplate6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Inkplate6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Inkplate6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate6.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
Inkplate6.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate6.menu.FlashMode.qio=QIO
Inkplate6.menu.FlashMode.qio.build.flash_mode=dio
Inkplate6.menu.FlashMode.qio.build.boot=qio
Inkplate6.menu.FlashMode.dio=DIO
Inkplate6.menu.FlashMode.dio.build.flash_mode=dio
Inkplate6.menu.FlashMode.dio.build.boot=dio
Inkplate6.menu.FlashMode.qout=QOUT
Inkplate6.menu.FlashMode.qout.build.flash_mode=dout
Inkplate6.menu.FlashMode.qout.build.boot=qout
Inkplate6.menu.FlashMode.dout=DOUT
Inkplate6.menu.FlashMode.dout.build.flash_mode=dout
Inkplate6.menu.FlashMode.dout.build.boot=dout

Inkplate6.menu.FlashFreq.80=80MHz
Inkplate6.menu.FlashFreq.80.build.flash_freq=80m
Inkplate6.menu.FlashFreq.40=40MHz
Inkplate6.menu.FlashFreq.40.build.flash_freq=40m

Inkplate6.menu.UploadSpeed.460800.linux=460800
Inkplate6.menu.UploadSpeed.460800.macosx=460800
Inkplate6.menu.UploadSpeed.460800.upload.speed=460800
Inkplate6.menu.UploadSpeed.921600=921600
Inkplate6.menu.UploadSpeed.921600.upload.speed=921600
Inkplate6.menu.UploadSpeed.115200=115200
Inkplate6.menu.UploadSpeed.115200.upload.speed=115200
Inkplate6.menu.UploadSpeed.256000.windows=256000
Inkplate6.menu.UploadSpeed.256000.upload.speed=256000
Inkplate6.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate6.menu.UploadSpeed.230400=230400
Inkplate6.menu.UploadSpeed.230400.upload.speed=230400
Inkplate6.menu.UploadSpeed.512000.windows=512000
Inkplate6.menu.UploadSpeed.512000.upload.speed=512000

Inkplate6.menu.DebugLevel.none=None
Inkplate6.menu.DebugLevel.none.build.code_debug=0
Inkplate6.menu.DebugLevel.error=Error
Inkplate6.menu.DebugLevel.error.build.code_debug=1
Inkplate6.menu.DebugLevel.warn=Warn
Inkplate6.menu.DebugLevel.warn.build.code_debug=2
Inkplate6.menu.DebugLevel.info=Info
Inkplate6.menu.DebugLevel.info.build.code_debug=3
Inkplate6.menu.DebugLevel.debug=Debug
Inkplate6.menu.DebugLevel.debug.build.code_debug=4
Inkplate6.menu.DebugLevel.verbose=Verbose
Inkplate6.menu.DebugLevel.verbose.build.code_debug=5


Inkplate10.name=Inkplate 10 (ESP32)

Inkplate10.upload.tool=esptool_py
Inkplate10.upload.maximum_size=1310720
Inkplate10.upload.maximum_data_size=327680
Inkplate10.upload.flags=
Inkplate10.upload.extra_flags=

Inkplate10.serial.disableDTR=true
Inkplate10.serial.disableRTS=true

Inkplate10.build.tarch=xtensa
Inkplate10.build.bootloader_addr=0x1000
Inkplate10.build.target=esp32
Inkplate10.build.mcu=esp32
Inkplate10.build.core=esp32
Inkplate10.build.variant=esp32
Inkplate10.build.board=INKPLATE10

Inkplate10.build.f_cpu=240000000L
Inkplate10.build.flash_size=4MB
Inkplate10.build.flash_freq=40m
Inkplate10.build.flash_mode=dio
Inkplate10.build.boot=dio
Inkplate10.build.partitions=default
Inkplate10.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
Inkplate10.build.extra_libs=

Inkplate10.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate10.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate10.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate10.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate10.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate10.menu.PartitionScheme.default.build.partitions=default
Inkplate10.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate10.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Inkplate10.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
Inkplate10.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Inkplate10.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate10.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate10.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate10.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate10.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate10.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate10.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Inkplate10.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate10.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate10.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Inkplate10.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate10.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate10.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Inkplate10.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate10.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate10.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate10.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
Inkplate10.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate10.menu.FlashMode.qio=QIO
Inkplate10.menu.FlashMode.qio.build.flash_mode=dio
Inkplate10.menu.FlashMode.qio.build.boot=qio
Inkplate10.menu.FlashMode.dio=DIO
Inkplate10.menu.FlashMode.dio.build.flash_mode=dio
Inkplate10.menu.FlashMode.dio.build.boot=dio
Inkplate10.menu.FlashMode.qout=QOUT
Inkplate10.menu.FlashMode.qout.build.flash_mode=dout
Inkplate10.menu.FlashMode.qout.build.boot=qout
Inkplate10.menu.FlashMode.dout=DOUT
Inkplate10.menu.FlashMode.dout.build.flash_mode=dout
Inkplate10.menu.FlashMode.dout.build.boot=dout

